_posts/c_sharp/2014-06-10-C#-file.html
---
layout: post
title: C# 文件操作
author: zrg
comments: false
description: C# 文件操作
categories:
- c#
tags:
- C#-文件操作
photos:
---

<p>
如果您遇到任何问题，请发送邮件至zrg1390556487@gmail.com。
</p>

<div id="outline-container-org3068e3c" class="outline-2">
<h2 id="org3068e3c">文件操作</h2>
<div class="outline-text-2" id="text-org3068e3c">
</div>
<div id="outline-container-org4a3b628" class="outline-3">
<h3 id="org4a3b628">文件名处理</h3>
<div class="outline-text-3" id="text-org4a3b628">
<div class="org-src-container">
<pre class="src src-emacs-lisp">//&#26367;&#25442;&#25481;&#38750;&#27861;&#23383;&#31526;
fileName = fileName.Replace(<span style="color: #CDC673;">":"</span>, <span style="color: #CDC673;">"_"</span>).Replace(<span style="color: #CDC673;">" "</span>, <span style="color: #CDC673;">"_"</span>).Replace(<span style="color: #CDC673;">"\\"</span>, <span style="color: #CDC673;">"_"</span>).Replace(<span style="color: #CDC673;">"/"</span>, <span style="color: #CDC673;">"_"</span>)<span style="color: #8B8878;">;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbb70b09" class="outline-3">
<h3 id="orgbb70b09">获取目录下所有文件的文件名</h3>
<div class="outline-text-3" id="text-orgbb70b09">
<div class="org-src-container">
<pre class="src src-emacs-lisp">String path = @<span style="color: #CDC673;">"X:\xxx\xxx"</span><span style="color: #8B8878;">;</span>

//&#31532;&#19968;&#31181;&#26041;&#27861;
var files = Directory.GetFiles(path, <span style="color: #CDC673;">"*.txt"</span>)<span style="color: #8B8878;">;</span>

foreach (var file in files)
    Console.WriteLine(file)<span style="color: #8B8878;">;</span>

//&#31532;&#20108;&#31181;&#26041;&#27861;
DirectoryInfo folder = new DirectoryInfo(path)<span style="color: #8B8878;">;</span>

foreach (FileInfo file in folder.GetFiles(<span style="color: #CDC673;">"*.txt"</span>))
{
    Console.WriteLine(file.FullName)<span style="color: #8B8878;">;</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orga199c28" class="outline-3">
<h3 id="orga199c28">C#判断文件和目录是否存在，不存在则创建</h3>
<div class="outline-text-3" id="text-orga199c28">
<div class="org-src-container">
<pre class="src src-emacs-lisp">&#25991;&#20214;&#65306;
if (File.Exists(Server.MapPath(<span style="color: #CDC673;">"~/upimg/Data.html"</span>))){
   File.Create(MapPath(<span style="color: #CDC673;">"~/upimg/Data.html"</span>))<span style="color: #8B8878;">;</span><span style="color: #8B8878;">//&#21019;&#24314;&#35813;&#25991;&#20214;</span>
}

&#25991;&#20214;&#22841;&#65306;
if (!Directory.Exists(Server.MapPath(<span style="color: #CDC673;">"~/upimg/hufu"</span>))){
   Directory.CreateDirectory(Server.MapPath(<span style="color: #CDC673;">"~/upimg/hufu"</span>))<span style="color: #8B8878;">;</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org1aa2aef" class="outline-3">
<h3 id="org1aa2aef">删除文件</h3>
<div class="outline-text-3" id="text-org1aa2aef">
<div class="org-src-container">
<pre class="src src-emacs-lisp">/// &lt;summary&gt;
/// &#21024;&#38500;&#21333;&#20010;&#25991;&#20214;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #CDC673;">"_filepath"</span>&gt;&#25991;&#20214;&#30456;&#23545;&#36335;&#24452;&lt;/param&gt;
public static bool DeleteFile(string _filepath)
{
   if (string.IsNullOrEmpty(_filepath))
   {
       return false<span style="color: #8B8878;">;</span>
   }
   string fullpath = GetMapPath(_filepath)<span style="color: #8B8878;">;</span>
   if (File.Exists(fullpath))
   {
       File.Delete(fullpath)<span style="color: #8B8878;">;</span>
       return true<span style="color: #8B8878;">;</span>
   }
   return false<span style="color: #8B8878;">;</span>
}
/// &lt;summary&gt;
/// &#21024;&#38500;&#19978;&#20256;&#30340;&#25991;&#20214;(&#21450;&#32553;&#30053;&#22270;)
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #CDC673;">"_filepath"</span>&gt;&lt;/param&gt;
public static void DeleteUpFile(string _filepath)
{
    if (string.IsNullOrEmpty(_filepath))
    {
        return<span style="color: #8B8878;">;</span>
    }
    string thumbnailpath = _filepath.Substring(0, _filepath.LastIndexOf(<span style="color: #CDC673;">"/"</span>)) + <span style="color: #CDC673;">"mall_"</span> + _filepath.Substring(_filepath.LastIndexOf(<span style="color: #CDC673;">"/"</span>) + 1)<span style="color: #8B8878;">;</span>
    string fullTPATH = GetMapPath(_filepath)<span style="color: #8B8878;">; </span><span style="color: #8B8878;">//&#23487;&#30053;&#22270;</span>
    string fullpath = GetMapPath(_filepath)<span style="color: #8B8878;">; </span><span style="color: #8B8878;">//&#21407;&#22270;</span>
    if (File.Exists(fullpath))
    {
        File.Delete(fullpath)<span style="color: #8B8878;">;</span>
    }
    if (File.Exists(fullTPATH))
    {
        File.Delete(fullTPATH)<span style="color: #8B8878;">;</span>
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org4934ff0" class="outline-3">
<h3 id="org4934ff0">返回文件大小KB</h3>
<div class="outline-text-3" id="text-org4934ff0">
<div class="org-src-container">
<pre class="src src-org"><span style="text-decoration: underline;">///</span> &lt;summary&gt;
<span style="text-decoration: underline;">///</span> &#36820;&#22238;&#25991;&#20214;&#22823;&#23567;KB
<span style="text-decoration: underline;">///</span> &lt;/summary&gt;
<span style="text-decoration: underline;">///</span> &lt;param name="_filepath"&gt;&#25991;&#20214;&#30456;&#23545;&#36335;&#24452;&lt;/param&gt;
<span style="text-decoration: underline;">///</span> &lt;returns&gt;int&lt;/returns&gt;
public static int GetFileSize(string _filepath)
{
    if (string.IsNullOrEmpty(_filepath))
    {
        return 0;
    }
    string fullpath = GetMapPath(_filepath);
    if (File.Exists(fullpath))
    {
        FileInfo fileInfo = new FileInfo(fullpath);
        return ((int)fileInfo.Length) / 1024;
    }
    return 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc3c72d" class="outline-3">
<h3 id="orgfc3c72d">返回文件扩展名，不含“.”</h3>
<div class="outline-text-3" id="text-orgfc3c72d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">/// &lt;summary&gt;
/// &#36820;&#22238;&#25991;&#20214;&#25193;&#23637;&#21517;&#65292;&#19981;&#21547;<span style="color: #FF8C00; font-weight: bold; font-style: italic; text-decoration: underline;">&#8220;</span>.<span style="color: #FF8C00; font-weight: bold; font-style: italic; text-decoration: underline;">&#8221;</span>
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #CDC673;">"_filepath"</span>&gt;&#25991;&#20214;&#20840;&#21517;&#31216;&lt;/param&gt;
/// &lt;returns&gt;string&lt;/returns&gt;
public static string GetFileExt(string _filepath)
{
    if (string.IsNullOrEmpty(_filepath))
    {
        return <span style="color: #CDC673;">""</span><span style="color: #8B8878;">;</span>
    }
    if (_filepath.LastIndexOf(<span style="color: #CDC673;">"."</span>) &gt; 0)
    {
        return _filepath.Substring(_filepath.LastIndexOf(<span style="color: #CDC673;">"."</span>) + 1)<span style="color: #8B8878;">; </span><span style="color: #8B8878;">//&#25991;&#20214;&#25193;&#23637;&#21517;&#65292;&#19981;&#21547;&#8220;.&#8221;</span>
    }
    return <span style="color: #CDC673;">""</span><span style="color: #8B8878;">;</span>
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8398f89" class="outline-2">
<h2 id="org8398f89">文件下载</h2>
<div class="outline-text-2" id="text-org8398f89">
</div>
<div id="outline-container-org1da4440" class="outline-3">
<h3 id="org1da4440">TransmitFile方式</h3>
<div class="outline-text-3" id="text-org1da4440">
<div class="org-src-container">
<pre class="src src-emacs-lisp">/* &#24494;&#36719;&#20026;Response&#23545;&#35937;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#26041;&#27861;TransmitFile&#26469;&#35299;&#20915;&#20351;&#29992;Response.BinaryWrite&#19979;&#36733;&#36229;&#36807;400MB&#30340;&#25991;&#20214;&#26102;&#65292;
&#23548;&#33268;Aspnet_wp.exe&#36827;&#31243;&#22238;&#25910;&#32780;&#26080;&#27861;&#25104;&#21151;&#19979;&#36733;&#30340;&#38382;&#39064;&#12290; &#20195;&#30721;&#22914;&#19979;&#65306;*/
Response.ContentType = <span style="color: #CDC673;">"application/x-zip-compressed"</span><span style="color: #8B8878;">;  </span>
string FileName = <span style="color: #CDC673;">"test.doc"</span><span style="color: #8B8878;">;  </span>
//&#20351;&#29992;UTF-8&#23545;&#25991;&#20214;&#21517;&#36827;&#34892;&#32534;&#30721;  
Response.AppendHeader(<span style="color: #CDC673;">"Content-Disposition"</span>, <span style="color: #CDC673;">"attachment;filename=\""</span> + HttpUtility.UrlEncode(FileName, System.Text.Encoding.UTF8) + <span style="color: #CDC673;">"\""</span>)<span style="color: #8B8878;">;  </span>
Response.ContentType = <span style="color: #CDC673;">"application/octet-stream"</span><span style="color: #8B8878;">;  </span>
Response.AddHeader(<span style="color: #CDC673;">"Content-Disposition"</span>, <span style="color: #CDC673;">"attachment;filename="</span> + FileName)<span style="color: #8B8878;">;  </span>
string filename = Server.MapPath(<span style="color: #CDC673;">"../ReportTemplate/test.doc"</span>)<span style="color: #8B8878;">;  </span>
Response.TransmitFile(filename)<span style="color: #8B8878;">;  </span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdb59497" class="outline-3">
<h3 id="orgdb59497">WriteFile方式</h3>
<div class="outline-text-3" id="text-orgdb59497">
<div class="org-src-container">
<pre class="src src-emacs-lisp">/* 
using System.IO<span style="color: #8B8878;">;          </span>
*/
string fileName = <span style="color: #CDC673;">"test.doc"</span><span style="color: #8B8878;">;</span><span style="color: #8B8878;">//&#23458;&#25143;&#31471;&#20445;&#23384;&#30340;&#25991;&#20214;&#21517;  </span>
string filePath = Server.MapPath(<span style="color: #CDC673;">"../ReportTemplate/test.doc"</span>)<span style="color: #8B8878;">;</span><span style="color: #8B8878;">//&#36335;&#24452;  </span>
FileInfo fileInfo = new FileInfo(filePath)<span style="color: #8B8878;">;  </span>
Response.Clear()<span style="color: #8B8878;">;  </span>
Response.ClearContent()<span style="color: #8B8878;">;  </span>
Response.ClearHeaders()<span style="color: #8B8878;">;  </span>
Response.AddHeader(<span style="color: #CDC673;">"Content-Disposition"</span>, <span style="color: #CDC673;">"attachment;filename=\""</span> + HttpUtility.UrlEncode(fileName, System.Text.Encoding.UTF8) + <span style="color: #CDC673;">"\""</span>)<span style="color: #8B8878;">;  </span>
Response.AddHeader(<span style="color: #CDC673;">"Content-Length"</span>, fileInfo.Length.ToString())<span style="color: #8B8878;">;  </span>
Response.AddHeader(<span style="color: #CDC673;">"Content-Transfer-Encoding"</span>, <span style="color: #CDC673;">"binary"</span>)<span style="color: #8B8878;">;  </span>
Response.ContentType = <span style="color: #CDC673;">"application/octet-stream"</span><span style="color: #8B8878;">;  </span>
Response.WriteFile(fileInfo.FullName)<span style="color: #8B8878;">;  </span>
Response.Flush()<span style="color: #8B8878;">;  </span>
Response.End()<span style="color: #8B8878;">;  </span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8221e17" class="outline-3">
<h3 id="org8221e17">WriteFile分块下载方式</h3>
<div class="outline-text-3" id="text-org8221e17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">string fileName = <span style="color: #CDC673;">"test.doc"</span><span style="color: #8B8878;">;</span><span style="color: #8B8878;">//&#23458;&#25143;&#31471;&#20445;&#23384;&#30340;&#25991;&#20214;&#21517;  </span>
string filePath = Server.MapPath(<span style="color: #CDC673;">"../ReportTemplate/test.doc"</span>)<span style="color: #8B8878;">;</span><span style="color: #8B8878;">//&#36335;&#24452;</span>

System.IO.FileInfo fileInfo = new System.IO.FileInfo(filePath)<span style="color: #8B8878;">;</span>

if (fileInfo.Exists == true)  
{  
    const long ChunkSize = 102400<span style="color: #8B8878;">; </span><span style="color: #8B8878;">//100K &#27599;&#27425;&#35835;&#21462;&#25991;&#20214;&#65292;&#21482;&#35835;&#21462;100K&#65292;&#36825;&#26679;&#21487;&#20197;&#32531;&#35299;&#26381;&#21153;&#22120;&#30340;&#21387;&#21147;  </span>
    byte[] buffer = new byte[ChunkSize]<span style="color: #8B8878;">;  </span>

    Response.Clear()<span style="color: #8B8878;">;  </span>
    System.IO.FileStream iStream = System.IO.File.OpenRead(filePath)<span style="color: #8B8878;">;  </span>
    long dataLengthToRead = iStream.Length<span style="color: #8B8878;">; </span><span style="color: #8B8878;">//&#33719;&#21462;&#19979;&#36733;&#30340;&#25991;&#20214;&#24635;&#22823;&#23567;  </span>
    Response.ContentType = <span style="color: #CDC673;">"application/octet-stream"</span><span style="color: #8B8878;">;  </span>
    Response.AddHeader(<span style="color: #CDC673;">"Content-Disposition"</span>,  
    <span style="color: #CDC673;">"attachment; filename="</span> + HttpUtility.UrlEncode(fileName, System.Text.Encoding.UTF8))<span style="color: #8B8878;">;  </span>
    while (dataLengthToRead &gt; 0 <span style="color: #5FD7FF;">&amp;&amp;</span> Response.IsClientConnected)  
    {  
        int lengthRead = iStream.Read(buffer, 0, Convert.ToInt32(ChunkSize))<span style="color: #8B8878;">; </span><span style="color: #8B8878;">//&#35835;&#21462;&#30340;&#22823;&#23567;  </span>
        Response.OutputStream.Write(buffer, 0, lengthRead)<span style="color: #8B8878;">;  </span>
        Response.Flush()<span style="color: #8B8878;">;  </span>
        dataLengthToRead = dataLengthToRead - lengthRead<span style="color: #8B8878;">;  </span>
    }  
    Response.Close()<span style="color: #8B8878;">;  </span>
}  
</pre>
</div>
</div>
</div>
<div id="outline-container-org0e2b215" class="outline-3">
<h3 id="org0e2b215">流方式下载</h3>
<div class="outline-text-3" id="text-org0e2b215">
<div class="org-src-container">
<pre class="src src-emacs-lisp">string fileName = <span style="color: #CDC673;">"test.doc"</span><span style="color: #8B8878;">;</span><span style="color: #8B8878;">//&#23458;&#25143;&#31471;&#20445;&#23384;&#30340;&#25991;&#20214;&#21517;  </span>
string filePath = Server.MapPath(<span style="color: #CDC673;">"../ReportTemplate/test.doc"</span>)<span style="color: #8B8878;">;</span><span style="color: #8B8878;">//&#36335;&#24452;</span>

//&#20197;&#23383;&#31526;&#27969;&#30340;&#24418;&#24335;&#19979;&#36733;&#25991;&#20214; 
FileStream fs = new FileStream(filePath, FileMode.Open)<span style="color: #8B8878;">;  </span>
byte[] bytes = new byte[(int)fs.Length]<span style="color: #8B8878;">;  </span>
fs.Read(bytes, 0, bytes.Length)<span style="color: #8B8878;">;  </span>
fs.Close()<span style="color: #8B8878;">;  </span>
Response.ContentType = <span style="color: #CDC673;">"application/octet-stream"</span><span style="color: #8B8878;">;  </span>
//&#36890;&#30693;&#27983;&#35272;&#22120;&#19979;&#36733;&#25991;&#20214;&#32780;&#19981;&#26159;&#25171;&#24320;  
Response.AddHeader(<span style="color: #CDC673;">"Content-Disposition"</span>, <span style="color: #CDC673;">"attachment;  filename="</span> + HttpUtility.UrlEncode(fileName, System.Text.Encoding.UTF8))<span style="color: #8B8878;">;  </span>
Response.BinaryWrite(bytes)<span style="color: #8B8878;">;  </span>
Response.Flush()<span style="color: #8B8878;">;  </span>
Response.End()<span style="color: #8B8878;">;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3a0c1f8" class="outline-2">
<h2 id="org3a0c1f8">参考资料</h2>
<div class="outline-text-2" id="text-org3a0c1f8">
<pre class="example">
http://www.cnblogs.com/CookBlack/archive/2011/04/10/1883864.html
http://www.cnblogs.com/technology/archive/2011/07/12/2104786.html
</pre>
</div>
</div>
